Revit 2027 API
ISelectionFilter.AllowElement Method
Override this pre-filter method to specify if the element should be permitted to be selected.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool AllowElement(
	Element elem
)
Function AllowElement (
	elem As Element
) As Boolean
bool AllowElement(
	Element^ elem
)
abstract AllowElement :
        elem : Element -> bool
Parameters
elem Element
A candidate element in selection operation.
Return Value
Boolean
Return true to allow the user to select this candidate element. Return false to prevent selection of this element.
Remarks
If prompting the user to select an element from a Revit Link instance, the element passed here will be the link instance, not the selected linked element. Access the linked element from Reference passed to the AllowReference() callback of ISelectionFilter.
If an exception is thrown from this method, the element will not be permitted to be selected.
See Also
Reference
ISelectionFilter Interface
Autodesk.Revit.UI.Selection Namespace